package com.example.finwise.models.lesson

import androidx.compose.runtime.Composable
import androidx.compose.runtime.MutableState
import androidx.compose.runtime.mutableFloatStateOf
import androidx.compose.runtime.mutableStateOf
import com.example.finwise.models.SharedPreferencesManager

open class Lesson(var id: Int, var progress: MutableState<Float>, var title: String, var steps: List<Step>)



var steps1 = listOf(
    Step(0,"Шаг 1: Зачем инвестировать?","Добро пожаловать в захватывающий мир инвестиций! Первый шаг в погружении в этот увлекательный мир - осознание целей инвестирования и понимание, почему это важно для вашего финансового благополучия.\n" +
            "\n" +
            "Инвестиции – это не просто средство увеличения капитала. Это стратегический подход к управлению финансами, который позволяет реализовать ваши финансовые планы и мечты. Будь то обеспечение безбедной пенсии, обеспечение образования для ваших детей или просто желание обеспечить финансовую стабильность – инвестиции являются ключом к достижению этих целей.\n" +
            "\n" +
            "Интересный факт: Концепция инвестирования имеет давнюю историю. Один из первых инвесторов – французский король Людовик XIV, который вложил свои средства в компанию по добыче и обработке свинца. Этот шаг не только приумножил его богатство, но также положил начало пониманию инвестиций как стратегического инструмента.", mutableStateOf(false)),
    Step(1,"Шаг 2: Основные виды инвестиций","Теперь, когда вы осознали важность инвестирования, давайте более подробно рассмотрим различные виды инвестиций. Акции представляют собой долю в собственности компании, позволяя вам стать ее совладельцем. Это открывает возможность получения дохода в виде дивидендов и участия в росте стоимости компании на рынке.\n" +
            "\n" +
            "Облигации, с другой стороны, представляют собой долговые инструменты, обеспечивающие инвестору фиксированный доход в виде процентов от суммы займа.\n" +
            "\n" +
            "Недвижимость, как форма инвестиций, обещает стабильный доход через аренду и возможность роста стоимости объекта со временем. Криптовалюты, с новым витком технологического развития, представляют цифровые активы, часто характеризующиеся высокой волатильностью, но и обладающие потенциалом для заметного роста капитала.", mutableStateOf(false)),
    Step(2,"Шаг 3: Разнообразие портфеля","Поговорим подробнее о важности разнообразия портфеля. Этот подход означает не только вложение в разные активы, но и тщательное распределение средств между различными классами активов. Создание разнообразного портфеля помогает снизить общий уровень риска, обеспечивает более стабильный доход и повышает устойчивость вашего портфеля к изменениям на рынке.\n" +
            " \n" +
            "Важно учесть, что разнообразие не ограничивается только выбором акций и облигаций. Включение в портфель таких активов, как недвижимость и криптовалюты, дополнительно расширяет ваш инвестиционный спектр. Недвижимость может предоставить стабильный поток дохода через аренду, а криптовалюты, будучи инновационными цифровыми активами, могут приносить высокие доходы, сопряженные, однако, с повышенным уровнем волатильности.\n" +
            " \n" +
            "Таким образом, создание балансированного портфеля с учетом разнообразия активов – ключ к успешному инвестированию в разнообразных экономических условиях. Оно способствует снижению общего риска и обеспечивает более устойчивый и надежный рост вашего инвестиционного капитала в долгосрочной перспективе.", mutableStateOf(false)),
    Step(3,"Шаг 4: Понимание рисков инвестиций","Инвестирование всегда связано с определенными рисками. Важно понимать и учитывать эти риски, чтобы принимать обоснованные решения. Основные виды рисков включают рыночный риск, когда ценность инвестиций изменяется из-за колебаний рынка, кредитный риск, связанный с вероятностью невыплаты долга, и инфляционный риск, который заключается в снижении покупательной способности денег.\n" +
            "\n" +
            "Также стоит учитывать риск ликвидности, когда актив нельзя быстро продать по разумной цене, и операционный риск, связанный с внутренними процессами, людьми и системами. Понимание этих рисков поможет вам лучше подготовиться к возможным потерям и избежать необдуманных инвестиционных решений.", mutableStateOf(false)),
    Step(4,"Шаг 5: Понимание налоговых аспектов инвестирования","Понимание налоговых обязательств и льгот является важным аспектом инвестиционной деятельности. В разных странах существуют различные налоговые правила относительно доходов от инвестиций, которые могут включать налоги на капитальные приросты, дивиденды и проценты. Инвесторам важно осведомленно подходить к планированию своих налоговых обязательств, чтобы максимизировать свои доходы после уплаты налогов.\n" +
            "\n" +
            "Некоторые инвестиционные продукты могут предложить налоговые льготы, например, пенсионные счета или инвестиционные фонды с налоговыми преимуществами. Инвесторы должны учитывать эти аспекты при составлении своего инвестиционного портфеля, чтобы использовать возможные налоговые преимущества.", mutableStateOf(false)))
object lesson1 : Lesson(0, mutableFloatStateOf(0f),"Валюты",steps1)



var steps2 = listOf(
    Step(0,"Шаг 1: Роль финансовых рынков","Добро пожаловать в увлекательный мир финансовых рынков! В этом уроке мы глубже исследуем их роль и значение в контексте инвестиций. Финансовые рынки служат не только местом для торговли различными активами, но и являются двигателем экономического роста, обеспечивая эффективное распределение капитала.\n" +
            " \n" +
            "Финансовые рынки делятся на два основных типа: первичные и вторичные. Первичные рынки представляют собой площадку, где новые финансовые инструменты впервые появляются, и инвесторы могут приобрести их через процесс первичного размещения. Вторичные рынки предоставляют возможность торговли уже существующими финансовыми инструментами между инвесторами.", mutableStateOf(false)),
    Step(1,"Шаг 2: Основные участники рынка","Давайте более детально рассмотрим основных участников финансовых рынков и их роли в процессе инвестирования.\n" +
            " \n" +
            "Брокеры и Дилеры:\n" +
            "Брокеры и дилеры являются ключевыми посредниками на финансовых рынках. Брокеры выступают в роли посредника между инвесторами и рынком, обеспечивая выполнение сделок. Они предоставляют доступ к торговым площадкам и исполняют ордера от клиентов. Дилеры, с другой стороны, активно участвуют в рыночных операциях, покупая и продавая финансовые инструменты с собственных активов.\n" +
            " \n" +
            "Инвесторы:\n" +
            "Инвесторы делятся на две основные категории: розничные и институциональные. Розничные инвесторы – это частные лица, инвестирующие свои личные средства на финансовых рынках. Институциональные инвесторы представляют собой крупные организации, такие как пенсионные фонды, страховые компании и инвестиционные фонды, управляющие средствами множества частных инвесторов.\n" +
            " \n" +
            "Биржа:\n" +
            "Биржа является центром торговли на финансовых рынках. Здесь встречаются покупатели и продавцы, чтобы совершать сделки. Биржевые индексы, такие как S&P 500 или Dow Jones, отражают общее состояние рынка и являются важными индикаторами для инвесторов.\n" +
            " \n" +
            "Понимание роли этих участников помогает инвесторам эффективнее взаимодействовать с рынком, принимать обоснованные решения и управлять своим инвестиционным портфелем.", mutableStateOf(false)),
    Step(2,"Шаг 3: Роль финансового планирования","Давайте поговорим о важной роли финансового планирования в управлении личными финансами. Финансовое планирование - это процесс определения финансовых целей, разработки стратегий для их достижения и мониторинга выполнения плана. Оно помогает управлять доходами, расходами, инвестициями и долгами, чтобы обеспечить финансовую стабильность и достижение желаемых результатов.\n" +
            "\n" +
            "Финансовое планирование включает в себя создание бюджетов, управление долгами, инвестирование и планирование на пенсию. Эффективное финансовое планирование может помочь уменьшить финансовый стресс, обеспечить финансовую безопасность и создать основу для достижения жизненных целей.", mutableStateOf(false)),
    Step(3,"Шаг 4: Виды финансовых инструментов","Поговорим о разнообразии финансовых инструментов, доступных на рынке. Акции представляют собой долю в собственности компании и предоставляют инвесторам право на долю прибыли и участие в управлении компанией. Облигации – это инструменты долга, где инвестор предоставляет заем, а эмитент обязуется выплатить проценты и вернуть заемную сумму.\n" +
            " \n" +
            "Валютный рынок позволяет торговать различными валютами, отражая экономическую активность стран. Товарные рынки, такие как рынок нефти или золота, предоставляют возможность инвестировать в реальные товары. Деривативы, включая опционы и фьючерсы, предоставляют инвесторам инструменты для управления рисками и спекуляции на будущие изменения цен. Это всего лишь небольшой обзор разнообразия инструментов, доступных для инвесторов на финансовых рынках.", mutableStateOf(false)),
    Step(4,"Шаг 5: Важность финансового образования",
            "Рассмотрим важность финансового образования и его влияние на финансовую грамотность. Финансовое образование играет ключевую роль в том, как мы управляем своими финансами и принимаем финансовые решения.\n" +
            "\n" +
            "Финансовая грамотность включает в себя понимание основных финансовых понятий, таких как бюджетирование, инвестирование, управление долгами и налогообложение. Она также помогает развивать навыки по управлению личными финансами, что важно для достижения финансовых целей и обеспечения финансовой стабильности.\n" +
            "\n" +
            "Финансовое образование позволяет людям принимать более осознанные решения о своих финансах, избегать финансовых ошибок и эффективно управлять своими средствами. Оно также помогает развивать финансовую независимость и создавать финансовое будущее, о котором мечтают многие.\n" +
            "\n" +
            "Инвестирование времени и усилий в обучение финансовым навыкам может принести значительные выгоды в будущем и помочь достичь финансового благополучия.", mutableStateOf(false)))
object lesson2 : Lesson(1, mutableFloatStateOf(0f),"Акции",steps2)



var steps3 = listOf(
    Step(0,"Шаг 1: Введение в инвестиционный анализ","Добро пожаловать в третий урок нашего курса! В этом уроке мы рассмотрим важные аспекты инвестиционного анализа. Инвестиционный анализ – это процесс оценки потенциала инвестиции с целью принятия обоснованных решений. Давайте погрузимся в мир анализа и выясним, каким образом он может помочь в принятии важных инвестиционных решений.\n" +
            " \n" +
            "Интересный факт: Известный инвестор Уоррен Баффет часто подчеркивает важность фундаментального анализа. Его философия заключается в том, что успешные инвестиции требуют тщательного изучения финансовых показателей компаний и понимания их бизнес-моделей.", mutableStateOf(false)),
    Step(1,"Шаг 2: Основные методы инвестиционного анализа","Существует несколько ключевых методов инвестиционного анализа, которые помогают инвесторам понять, стоит ли инвестировать в конкретный актив или портфель. Фундаментальный анализ фокусируется на изучении финансовых показателей компаний, таких как прибыль, долг и перспективы роста. Технический анализ, напротив, анализирует графики цен и объемов торгов для выявления тенденций и прогнозирования будущих изменений цен.\n" +
            " \n" +
            "Оценка риска также важна. Рискованные инвестиции могут принести высокую прибыль, но также повлечь за собой большие потери. Диверсификация, или распределение инвестиций по разным активам, снижает общий риск портфеля. Выбор между консервативными и агрессивными стратегиями зависит от финансовых целей и уровня терпимости к риску инвестора.", mutableStateOf(false)),
    Step(2, "Шаг 3: Значение финансовой грамотности","Давайте обсудим важность финансовой грамотности и ее роль в личных финансах. Финансовая грамотность означает понимание финансовых понятий, умение управлять деньгами и принимать обоснованные финансовые решения.\n" +
            "\n" +
            "Финансовая грамотность помогает людям более эффективно управлять своими доходами и расходами. Она включает в себя умение создавать бюджет, следить за расходами, инвестировать и планировать на пенсию. Более финансово грамотные люди обычно имеют меньше финансовых проблем и более стабильное финансовое будущее.\n" +
            "\n" +
            "Образование в области финансовой грамотности также помогает избегать распространенных финансовых ошибок, таких как чрезмерное задолженность, неправильное инвестирование и недостаточное планирование на будущее. Поэтому важно инвестировать время и усилия в развитие финансовых навыков и знаний.", mutableStateOf(false)),
    Step(3,"Шаг 4: Значение риска и диверсификации","Риск – неотъемлемая часть инвестирования, и понимание его важности помогает принимать более обоснованные решения. Диверсификация, или распределение инвестиций по различным активам, помогает снизить общий риск портфеля. Когда один актив показывает отрицательные результаты, другие могут смягчить убытки, сохраняя стабильность вложений.\n" +
            " \n" +
            "Различные активы имеют разные уровни риска. Например, акции часто более рискованы, но и приносят высокую прибыль. Облигации, с другой стороны, менее рискованы, но и приносят меньший доход. Понимание своего финансового положения и целей помогает выбрать оптимальное сочетание активов для достижения желаемого баланса между риском и доходностью.", mutableStateOf(false)),
    Step(4,"Шаг 5: Путь к финансовой грамотности", "Как достичь финансовой грамотности? Этот процесс требует обучения и самообучения. Вот несколько шагов, которые помогут вам стать более финансово грамотным:\n" +
            "\n" +
            "Изучите основы: Начните с изучения основных финансовых понятий, таких как доход, расходы, бюджетирование, инвестирование и долги. Это поможет вам построить крепкое финансовое основание.\n" +
            "\n" +
            "Читайте и исследуйте: Чтение финансовых книг, статей и онлайн-ресурсов поможет углубить знания и получить советы от экспертов.\n" +
            "\n" +
            "Учите из опыта: Анализируйте свои финансовые решения и ошибки. Что можно было бы сделать лучше? Какие уроки можно извлечь из прошлого опыта?\n" +
            "\n" +
            "Практикуйтесь: Начните применять полученные знания на практике. Создайте бюджет, начните инвестировать или улучшайте управление долгами.\n" +
            "\n" +
            "Общайтесь с профессионалами: Если у вас возникают сложные финансовые вопросы, не стесняйтесь обращаться за советом к финансовым консультантам или экономическим экспертам.\n" +
            "\n" +
            "Финансовая грамотность - это навык, который приходит с опытом и обучением. С постоянным стремлением к обучению и улучшению, вы можете уверенно управлять своими финансами и принимать обоснованные финансовые решения.", mutableStateOf(false)))
object lesson3 : Lesson(2, mutableFloatStateOf(0f),"Облигации",steps3)



var steps4 = listOf(
    Step(0,"Шаг 1: Введение в Разнообразие Инвестиционных Стратегий","Добро пожаловать в четвертый урок нашего курса! Сегодня мы поговорим о разнообразии инвестиционных стратегий. Инвестирование — это не только процесс, но и искусство, требующее понимания различных стратегий для достижения ваших финансовых целей. Давайте рассмотрим различные подходы к инвестированию и узнаем, как выбрать стратегию, соответствующую вашим потребностям.", mutableStateOf(false)),
    Step(1,"Шаг 2: Основные Инвестиционные Стратегии","Инвестиционные стратегии разнообразны и могут варьироваться в зависимости от ваших финансовых целей, уровня риска и временных рамок. Вот несколько ключевых стратегий:\n" +
            " \n" +
            "1. Долгосрочные инвестиции: Основаны на убеждении, что рынок в целом будет расти в течение длительного периода. Инвесторы выбирают стабильные акции или фонды и держат их на протяжении многих лет, игнорируя краткосрочные колебания рынка.\n" +
            " \n" +
            "2. Краткосрочные инвестиции: Ориентированы на получение прибыли от краткосрочных изменений в ценах активов. Инвесторы активно торгуют, стремясь выйти на пике цен.\n" +
            " \n" +
            "3. Доходные инвестиции: Основаны на получении регулярного дохода от инвестиций, таких как облигации или дивидендные акции. Эта стратегия подходит для тех, кто ищет стабильные выплаты.\n" +
            " \n" +
            "4. Стратегия роста: Инвесторы выбирают активы с высоким потенциалом роста. Это может быть как акции стартапов, так и инновационные области рынка.", mutableStateOf(false)),
    Step(2, "Шаг 3: Типы Финансовых Инструментов","Давайте рассмотрим разнообразие финансовых инструментов, доступных на рынке. Финансовые инструменты представляют собой различные активы, в которые инвесторы могут вложить свои средства. Вот несколько основных типов финансовых инструментов:\n" +
            "\n" +
            "Акции: Представляют собой долю в собственности компании. Инвесторы, покупая акции, становятся ее совладельцами и имеют право на часть прибыли и участие в управлении компанией.\n" +
            "\n" +
            "Облигации: Это инструменты долга, где инвестор предоставляет заем компании или правительству. В обмен на заемные средства, эмитент обязуется выплачивать проценты и вернуть заемную сумму.\n" +
            "\n" +
            "Валютный рынок: Позволяет торговать различными валютами. Курсы обмена отражают экономическую активность стран и могут быть предметом спекуляции.\n" +
            "\n" +
            "Товарные рынки: Здесь можно инвестировать в реальные товары, такие как нефть, золото, зерно и другие сырьевые товары. Цены на товары могут колебаться в зависимости от спроса и предложения.\n" +
            "\n" +
            "Деривативы: Включают опционы, фьючерсы и другие производные инструменты. Они позволяют инвесторам управлять рисками и спекулировать на будущие изменения цен на активы.\n" +
            "\n" +
            "Это всего лишь небольшой обзор разнообразия финансовых инструментов, доступных для инвесторов на финансовых рынках.", mutableStateOf(false)),
    Step(3,"Шаг 4: Роль Риска в Инвестициях","Риск — неотъемлемый аспект инвестиций, и понимание его роли помогает вам принимать обоснованные решения. Различные стратегии предоставляют разные уровни риска. Долгосрочные инвестиции обычно менее подвержены краткосрочным колебаниям рынка, в то время как стратегии краткосрочных инвестиций могут быть более рискованными, но и более прибыльными.\n" +
            " \n" +
            "Выбор стратегии должен соответствовать вашему уровню комфорта с риском и финансовым целям. Запомните, что разнообразие инвестиций в различные активы и секторы может снизить ваш общий риск.", mutableStateOf(false)),
    Step(4,"Шаг 5: Подведение итогов","На этом этапе урока мы рассмотрели разнообразие инвестиционных стратегий и финансовых инструментов. Важно помнить, что выбор конкретной стратегии и инструментов должен соответствовать вашим финансовым целям, уровню риска и временным рамкам.\n" +
            "\n" +
            "Инвестиции могут быть инструментом для достижения финансовой стабильности и роста вашего капитала. Понимание различных стратегий и инструментов поможет вам принимать обоснованные решения и добиваться желаемых результатов.\n" +
            "\n" +
            "Продолжайте учиться и исследовать мир инвестиций, чтобы лучше управлять своими финансами и строить успешное финансовое будущее.", mutableStateOf(false)))
object lesson4 : Lesson(3, mutableFloatStateOf(0f),"ИИС",steps4)



var steps5 = listOf(
    Step(0,"Шаг 1: Введение в Роль Управления Портфелем","Дорогие студенты, добро пожаловать в последний урок нашего курса по инвестициям! Сегодня мы проведем финальный этап нашего увлекательного путешествия в мире финансов. Но перед тем как приступить к обсуждению стратегий управления портфелем, давайте расскажем вам интересный факт.\n" +
            " \n" +
            "*Интересный факт:* Одним из самых известных инвесторов в истории является Уоррен Баффет. Он начал свой путь с инвестиций еще в детстве, продавая газеты. Баффет стал известен своим долгосрочным инвестиционным подходом и принципом \"нежного вложения\". Сейчас он часто цитируется и рассматривается как один из самых успешных инвесторов в мире.\n" +
            " \n" +
            "Теперь, когда мы вас немного вдохновили, давайте перейдем к обсуждению стратегий управления портфелем.", mutableStateOf(false)),
    Step(1,"Шаг 2: Стратегии Управления Портфелем","Управление портфелем – это искусство балансировки риска и доходности, чтобы достичь ваших финансовых целей. Вот несколько ключевых стратегий управления портфелем:\n" +
            " \n" +
            "1. **Ребалансировка портфеля:** Регулярное перераспределение активов в портфеле для восстановления исходного баланса. Это помогает управлять риском и сохранять стабильность портфеля.\n" +
            " \n" +
            "2. **Тактическое управление активами:** Активное реагирование на изменения рыночных условий. Инвесторы могут корректировать свой портфель в зависимости от текущих трендов и перспектив рынка.\n" +
            " \n" +
            "3. **Стратегии защиты от риска:** Включают в себя использование инструментов, таких как опционы и облигации, для снижения потенциальных убытков в периоды рыночной нестабильности.", mutableStateOf(false)),
    Step(2, "Шаг 3: Важность Образования и Постоянного Развития","В мире инвестиций, образование играет ключевую роль. Рынок финансов постоянно меняется, и чтобы успешно управлять своим портфелем, важно быть в курсе последних тенденций и новостей.\n" +
            "\n" +
            "Обучение и постоянное развитие помогут вам лучше понимать риски и возможности, с которыми вы сталкиваетесь как инвестор. Это также поможет вам принимать информированные решения и адаптироваться к изменяющимся условиям рынка.", mutableStateOf(false)),
    Step(3, "Шаг 4: Инвестиционные Инструменты и Их Оценка","В этом шаге мы более подробно рассмотрим различные инвестиционные инструменты и способы их оценки. В мире финансовых рынков существует множество активов, в которые можно инвестировать, и понимание их особенностей и потенциала - ключевой элемент успешного инвестирования.\n" +
            "\n" +
            "Акции: Рассмотрим, что представляют собой акции, как оценивать финансовое состояние компаний и как выбирать перспективные акции для инвестирования.\n" +
            "\n" +
            "Облигации: Узнаем, как работают облигации, как оценивать их риски и доходность, и как выбирать правильные облигации в зависимости от ваших целей.\n" +
            "\n" +
            "Деривативы: Изучим деривативы, такие как опционы и фьючерсы, и какие возможности они предоставляют для защиты от риска или спекуляции.\n" +
            "\n" +
            "Валюты и товары: Рассмотрим торговлю валютами и товарами на мировых рынках, и какие факторы влияют на их цены.\n" +
            "\n" +
            "Оценка инвестиционных инструментов: Поговорим о методах оценки инвестиционных инструментов, включая фундаментальный и технический анализ, и как выбирать подходящий метод для конкретного актива.\n" +
            "\n" +
            "Этот шаг поможет вам лучше понять разнообразие инвестиционных возможностей и как проводить анализ для принятия обоснованных решений.", mutableStateOf(false)),
    Step(4,"Шаг 5: Финальные Мысли и Советы","В завершение этого курса, давайте поделимся несколькими советами. Важно помнить, что инвестирование - это долгосрочный процесс, и успех требует терпения и дисциплины.\n" +
            "\n" +
            "Разнообразьте свой портфель: Не ставьте все свои яйца в одну корзину. Распределите инвестиции по разным активам и секторам, чтобы снизить риск.\n" +
            "\n" +
            "Инвестируйте с умом: Изучайте активы, в которые вы вкладываете свои деньги. Понимание основ и фундаментальных показателей компаний поможет вам сделать более обоснованный выбор.\n" +
            "\n" +
            "Следите за рынком: Будьте в курсе текущих событий и новостей, которые могут повлиять на ваши инвестиции.\n" +
            "\n" +
            "Не бойтесь запросить совет: Если вы не уверены в своих знаниях, обратитесь за советом к профессионалам или финансовым консультантам.\n" +
            "\n" +
            "Долгосрочное мышление: Инвестиции, как правило, приносят наибольшую выгоду в долгосрочной перспективе. Постоянно перераспределяйте портфель и держитесь своей стратегии.\n" +
            "\n" +
            "Спасибо за участие в этом курсе. Не забывайте учиться и развиваться как инвесторы, и удачи в ваших инвестиционных усилиях!", mutableStateOf(false)))
object lesson5 : Lesson(4,mutableFloatStateOf(0f),"Трейдинг",steps5)



var lessons = listOf(lesson1,lesson2,lesson3,lesson4,lesson5)

@Composable
fun getLessons(): List<Lesson>{
    return lessons
}
@Composable
fun getLessonById(id: Int): Lesson{
    return lessons[id]
}

@Composable
fun getSteps(id: Int): List<Step> {
    return lessons[id].steps
}

fun confirmStep(lessonId: Int, stepId: Int){
    lessons[lessonId].steps[stepId].completed.value=true
    lessons[lessonId].progress.value= calculateCompletionRatio(lessonId)

}
fun calculateCompletionRatio(lessonId: Int): Float {
    var totalSteps = lessons[lessonId].steps.size

    var completedSteps = 0


    for (step in lessons[lessonId].steps) {
        if (step.completed.value) {
            completedSteps++
        }
    }
    SharedPreferencesManager.setProgress("L"+(lessonId+1).toString(),completedSteps.toFloat() / totalSteps.toFloat())
    return SharedPreferencesManager.getProgress("L"+(lessonId+1).toString())
}